consumir_middleware_exemplos/benchmark/resultados_nao_usados/testes_100000_write/SQLStreamify.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Target transaction rate: 60/sec
Report intermediate results every 2 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 2s ] thds: 32 tps: 54.46 qps: 350.75 (r/w/o: 0.00/235.34/115.42) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 2s ] queue length: 0, concurrency: 13
[ 4s ] thds: 32 tps: 68.97 qps: 399.85 (r/w/o: 0.00/266.40/133.45) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 4s ] queue length: 0, concurrency: 4
[ 6s ] thds: 32 tps: 56.03 qps: 331.15 (r/w/o: 0.00/220.10/111.05) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 6s ] queue length: 0, concurrency: 3
[ 8s ] thds: 32 tps: 58.47 qps: 351.85 (r/w/o: 0.00/234.40/117.45) lat (ms,95%): 314.45 err/s: 0.50 reconn/s: 0.00
[ 8s ] queue length: 0, concurrency: 3
[ 10s ] thds: 32 tps: 61.53 qps: 370.16 (r/w/o: 0.00/246.61/123.55) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 10s ] queue length: 0, concurrency: 3
[ 12s ] thds: 32 tps: 58.47 qps: 363.32 (r/w/o: 0.00/243.38/119.94) lat (ms,95%): 101.13 err/s: 0.50 reconn/s: 0.00
[ 12s ] queue length: 0, concurrency: 8
[ 14s ] thds: 32 tps: 60.03 qps: 347.67 (r/w/o: 0.00/230.11/117.56) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 14s ] queue length: 0, concurrency: 3
[ 16s ] thds: 32 tps: 69.47 qps: 423.80 (r/w/o: 0.00/283.87/139.94) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 16s ] queue length: 0, concurrency: 5
[ 18s ] thds: 32 tps: 70.03 qps: 425.69 (r/w/o: 0.00/282.63/143.06) lat (ms,95%): 204.11 err/s: 0.50 reconn/s: 0.00
[ 18s ] queue length: 0, concurrency: 10
[ 20s ] thds: 32 tps: 63.97 qps: 395.82 (r/w/o: 0.00/262.38/133.44) lat (ms,95%): 244.38 err/s: 0.50 reconn/s: 0.00
[ 20s ] queue length: 0, concurrency: 20
[ 22s ] thds: 32 tps: 69.53 qps: 401.19 (r/w/o: 0.00/269.12/132.06) lat (ms,95%): 267.41 err/s: 1.00 reconn/s: 0.00
[ 22s ] queue length: 0, concurrency: 4
[ 24s ] thds: 32 tps: 54.47 qps: 339.34 (r/w/o: 0.00/225.90/113.45) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 24s ] queue length: 0, concurrency: 14
[ 26s ] thds: 32 tps: 62.03 qps: 366.17 (r/w/o: 0.00/245.11/121.06) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 26s ] queue length: 0, concurrency: 7
[ 28s ] thds: 32 tps: 55.97 qps: 327.34 (r/w/o: 0.00/217.40/109.95) lat (ms,95%): 158.63 err/s: 0.50 reconn/s: 0.00
[ 28s ] queue length: 0, concurrency: 2
[ 30s ] thds: 32 tps: 56.03 qps: 348.66 (r/w/o: 0.00/232.11/116.55) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 30s ] queue length: 0, concurrency: 11
[ 32s ] thds: 32 tps: 61.97 qps: 366.32 (r/w/o: 0.00/244.88/121.44) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 32s ] queue length: 0, concurrency: 6
[ 34s ] thds: 32 tps: 60.53 qps: 353.69 (r/w/o: 0.00/235.13/118.56) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 34s ] queue length: 0, concurrency: 1
[ 36s ] thds: 32 tps: 55.98 qps: 340.85 (r/w/o: 0.00/227.90/112.95) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 36s ] queue length: 0, concurrency: 3
[ 38s ] thds: 32 tps: 67.03 qps: 409.67 (r/w/o: 0.00/273.11/136.56) lat (ms,95%): 189.93 err/s: 0.50 reconn/s: 0.00
[ 38s ] queue length: 0, concurrency: 7
[ 40s ] thds: 32 tps: 63.97 qps: 380.83 (r/w/o: 0.00/253.89/126.94) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 40s ] queue length: 0, concurrency: 5
[ 42s ] thds: 32 tps: 66.53 qps: 396.68 (r/w/o: 0.00/264.12/132.56) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 42s ] queue length: 0, concurrency: 4
[ 44s ] thds: 32 tps: 52.98 qps: 326.35 (r/w/o: 0.00/218.90/107.45) lat (ms,95%): 110.66 err/s: 0.50 reconn/s: 0.00
[ 44s ] queue length: 0, concurrency: 6
[ 46s ] thds: 32 tps: 52.52 qps: 305.14 (r/w/o: 0.00/202.09/103.05) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 46s ] queue length: 0, concurrency: 2
[ 48s ] thds: 32 tps: 51.98 qps: 328.35 (r/w/o: 0.00/218.90/109.45) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 48s ] queue length: 0, concurrency: 13
[ 50s ] thds: 32 tps: 66.53 qps: 378.67 (r/w/o: 0.00/251.61/127.06) lat (ms,95%): 200.47 err/s: 0.50 reconn/s: 0.00
[ 50s ] queue length: 0, concurrency: 0
[ 52s ] thds: 32 tps: 54.48 qps: 326.85 (r/w/o: 0.00/217.90/108.95) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 52s ] queue length: 0, concurrency: 0
[ 54s ] thds: 32 tps: 48.52 qps: 322.15 (r/w/o: 0.00/216.10/106.05) lat (ms,95%): 282.25 err/s: 0.50 reconn/s: 0.00
[ 54s ] queue length: 0, concurrency: 17
[ 56s ] thds: 32 tps: 45.48 qps: 286.87 (r/w/o: 0.00/185.91/100.95) lat (ms,95%): 1170.65 err/s: 2.50 reconn/s: 0.00
[ 56s ] queue length: 22, concurrency: 32
[ 58s ] thds: 32 tps: 60.53 qps: 370.67 (r/w/o: 0.00/242.61/128.06) lat (ms,95%): 1618.78 err/s: 7.00 reconn/s: 0.00
[ 58s ] queue length: 10, concurrency: 32
[ 60s ] thds: 32 tps: 59.97 qps: 378.83 (r/w/o: 0.00/252.88/125.94) lat (ms,95%): 1618.78 err/s: 6.00 reconn/s: 0.00
[ 60s ] queue length: 30, concurrency: 32
[ 62s ] thds: 32 tps: 67.53 qps: 419.19 (r/w/o: 0.00/277.63/141.56) lat (ms,95%): 1561.52 err/s: 6.50 reconn/s: 0.00
[ 62s ] queue length: 21, concurrency: 32
[ 64s ] thds: 32 tps: 60.97 qps: 390.32 (r/w/o: 0.00/258.88/131.44) lat (ms,95%): 1903.57 err/s: 9.50 reconn/s: 0.00
[ 64s ] queue length: 35, concurrency: 32
[ 66s ] thds: 32 tps: 72.54 qps: 441.71 (r/w/o: 0.00/293.64/148.07) lat (ms,95%): 1479.41 err/s: 3.00 reconn/s: 0.00
[ 66s ] queue length: 13, concurrency: 32
[ 68s ] thds: 32 tps: 71.97 qps: 412.31 (r/w/o: 0.00/280.37/131.94) lat (ms,95%): 1258.08 err/s: 3.00 reconn/s: 0.00
[ 68s ] queue length: 0, concurrency: 2
[ 70s ] thds: 32 tps: 60.03 qps: 367.67 (r/w/o: 0.00/245.61/122.06) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 70s ] queue length: 0, concurrency: 6
[ 72s ] thds: 32 tps: 59.47 qps: 348.84 (r/w/o: 0.00/231.40/117.45) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 72s ] queue length: 0, concurrency: 3
[ 74s ] thds: 32 tps: 48.51 qps: 305.58 (r/w/o: 0.00/204.05/101.53) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 74s ] queue length: 0, concurrency: 13
[ 76s ] thds: 32 tps: 66.98 qps: 392.90 (r/w/o: 0.00/259.93/132.97) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 76s ] queue length: 0, concurrency: 10
[ 78s ] thds: 32 tps: 60.03 qps: 364.67 (r/w/o: 0.00/245.11/119.55) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 78s ] queue length: 0, concurrency: 10
[ 80s ] thds: 32 tps: 58.97 qps: 350.34 (r/w/o: 0.00/233.89/116.45) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 80s ] queue length: 0, concurrency: 6
[ 82s ] thds: 32 tps: 54.02 qps: 324.65 (r/w/o: 0.00/216.60/108.05) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 82s ] queue length: 0, concurrency: 6
[ 84s ] thds: 32 tps: 55.48 qps: 341.36 (r/w/o: 0.00/225.90/115.45) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 84s ] queue length: 0, concurrency: 16
[ 86s ] thds: 32 tps: 65.03 qps: 387.66 (r/w/o: 0.00/261.11/126.55) lat (ms,95%): 272.27 err/s: 0.50 reconn/s: 0.00
[ 86s ] queue length: 0, concurrency: 7
[ 88s ] thds: 32 tps: 43.98 qps: 269.37 (r/w/o: 0.00/172.92/96.45) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 88s ] queue length: 0, concurrency: 24
[ 90s ] thds: 32 tps: 75.03 qps: 447.21 (r/w/o: 0.00/303.64/143.57) lat (ms,95%): 816.63 err/s: 3.50 reconn/s: 0.00
[ 90s ] queue length: 0, concurrency: 4
[ 92s ] thds: 32 tps: 59.97 qps: 360.35 (r/w/o: 0.00/239.90/120.45) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 92s ] queue length: 0, concurrency: 5
[ 94s ] thds: 32 tps: 58.02 qps: 340.14 (r/w/o: 0.00/226.10/114.05) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 94s ] queue length: 0, concurrency: 1
[ 96s ] thds: 32 tps: 57.47 qps: 352.34 (r/w/o: 0.00/235.89/116.45) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 96s ] queue length: 0, concurrency: 4
[ 98s ] thds: 32 tps: 60.52 qps: 362.14 (r/w/o: 0.00/241.09/121.05) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 98s ] queue length: 0, concurrency: 4
[ 100s ] thds: 32 tps: 56.48 qps: 336.37 (r/w/o: 0.00/223.91/112.46) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 100s ] queue length: 0, concurrency: 3
[ 102s ] thds: 32 tps: 54.53 qps: 325.65 (r/w/o: 0.00/217.10/108.55) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 102s ] queue length: 0, concurrency: 2
[ 104s ] thds: 32 tps: 60.47 qps: 362.83 (r/w/o: 0.00/241.89/120.94) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 104s ] queue length: 0, concurrency: 2
[ 106s ] thds: 32 tps: 59.03 qps: 360.17 (r/w/o: 0.00/240.61/119.55) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 106s ] queue length: 0, concurrency: 5
[ 108s ] thds: 32 tps: 46.48 qps: 289.88 (r/w/o: 0.00/186.92/102.96) lat (ms,95%): 84.47 err/s: 0.50 reconn/s: 0.00
[ 108s ] queue length: 0, concurrency: 24
[ 110s ] thds: 32 tps: 74.53 qps: 451.70 (r/w/o: 0.00/305.63/146.06) lat (ms,95%): 926.33 err/s: 2.00 reconn/s: 0.00
[ 110s ] queue length: 0, concurrency: 14
[ 112s ] thds: 32 tps: 55.97 qps: 347.84 (r/w/o: 0.00/232.39/115.45) lat (ms,95%): 363.18 err/s: 0.50 reconn/s: 0.00
[ 112s ] queue length: 0, concurrency: 21
[ 114s ] thds: 32 tps: 73.53 qps: 414.68 (r/w/o: 0.00/276.62/138.06) lat (ms,95%): 427.07 err/s: 0.00 reconn/s: 0.00
[ 114s ] queue length: 0, concurrency: 1
[ 116s ] thds: 32 tps: 58.97 qps: 366.83 (r/w/o: 0.00/244.39/122.44) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 116s ] queue length: 0, concurrency: 11
[ 118s ] thds: 32 tps: 68.03 qps: 408.69 (r/w/o: 0.00/272.62/136.06) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 118s ] queue length: 0, concurrency: 11
[ 120s ] thds: 32 tps: 63.97 qps: 376.83 (r/w/o: 0.00/251.38/125.44) lat (ms,95%): 427.07 err/s: 0.50 reconn/s: 0.00
[ 120s ] queue length: 0, concurrency: 5
[ 122s ] thds: 32 tps: 70.03 qps: 417.19 (r/w/o: 0.00/278.13/139.06) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 122s ] queue length: 0, concurrency: 3
[ 124s ] thds: 32 tps: 60.00 qps: 358.50 (r/w/o: 0.00/238.50/120.00) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 124s ] queue length: 0, concurrency: 3
[ 126s ] thds: 32 tps: 61.50 qps: 366.47 (r/w/o: 0.00/243.48/122.99) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 126s ] queue length: 0, concurrency: 3
[ 128s ] thds: 32 tps: 60.48 qps: 371.35 (r/w/o: 0.00/248.90/122.45) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 128s ] queue length: 0, concurrency: 8
[ 130s ] thds: 32 tps: 60.53 qps: 358.17 (r/w/o: 0.00/238.12/120.06) lat (ms,95%): 204.11 err/s: 0.50 reconn/s: 0.00
[ 130s ] queue length: 0, concurrency: 4
[ 132s ] thds: 32 tps: 64.47 qps: 385.83 (r/w/o: 0.00/257.39/128.44) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 132s ] queue length: 0, concurrency: 2
[ 134s ] thds: 32 tps: 57.53 qps: 353.15 (r/w/o: 0.00/235.60/117.55) lat (ms,95%): 244.38 err/s: 0.50 reconn/s: 0.00
[ 134s ] queue length: 0, concurrency: 6
[ 136s ] thds: 32 tps: 48.48 qps: 310.86 (r/w/o: 0.00/203.41/107.45) lat (ms,95%): 926.33 err/s: 2.00 reconn/s: 0.00
[ 136s ] queue length: 0, concurrency: 23
[ 138s ] thds: 32 tps: 71.03 qps: 407.68 (r/w/o: 0.00/274.12/133.56) lat (ms,95%): 995.51 err/s: 1.00 reconn/s: 0.00
[ 138s ] queue length: 0, concurrency: 4
[ 140s ] thds: 32 tps: 50.48 qps: 337.84 (r/w/o: 0.00/225.89/111.95) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 140s ] queue length: 0, concurrency: 27
[ 142s ] thds: 32 tps: 77.04 qps: 440.71 (r/w/o: 0.00/295.14/145.57) lat (ms,95%): 450.77 err/s: 1.50 reconn/s: 0.00
[ 142s ] queue length: 0, concurrency: 6
[ 144s ] thds: 32 tps: 69.47 qps: 418.31 (r/w/o: 0.00/277.88/140.44) lat (ms,95%): 227.40 err/s: 0.50 reconn/s: 0.00
[ 144s ] queue length: 0, concurrency: 8
[ 146s ] thds: 32 tps: 50.52 qps: 331.15 (r/w/o: 0.00/219.60/111.55) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 146s ] queue length: 0, concurrency: 29
[ 148s ] thds: 32 tps: 50.98 qps: 290.87 (r/w/o: 0.00/191.41/99.45) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
[ 148s ] queue length: 0, concurrency: 24
[ 150s ] thds: 32 tps: 77.53 qps: 456.68 (r/w/o: 0.00/308.62/148.06) lat (ms,95%): 363.18 err/s: 0.50 reconn/s: 0.00
[ 150s ] queue length: 0, concurrency: 5
[ 152s ] thds: 32 tps: 58.48 qps: 334.86 (r/w/o: 0.00/221.91/112.95) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 152s ] queue length: 0, concurrency: 1
[ 154s ] thds: 32 tps: 55.52 qps: 337.60 (r/w/o: 0.00/225.06/112.53) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 154s ] queue length: 0, concurrency: 3
[ 156s ] thds: 32 tps: 62.99 qps: 373.42 (r/w/o: 0.00/248.95/124.47) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 156s ] queue length: 0, concurrency: 1
[ 158s ] thds: 32 tps: 68.53 qps: 425.67 (r/w/o: 0.00/284.61/141.06) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 158s ] queue length: 0, concurrency: 9
[ 160s ] thds: 32 tps: 61.47 qps: 370.83 (r/w/o: 0.00/244.89/125.94) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 160s ] queue length: 0, concurrency: 15
[ 162s ] thds: 32 tps: 66.03 qps: 398.18 (r/w/o: 0.00/264.62/133.56) lat (ms,95%): 442.73 err/s: 1.00 reconn/s: 0.00
[ 162s ] queue length: 0, concurrency: 16
[ 164s ] thds: 32 tps: 66.97 qps: 401.84 (r/w/o: 0.00/268.39/133.45) lat (ms,95%): 601.29 err/s: 1.50 reconn/s: 0.00
[ 164s ] queue length: 0, concurrency: 13
[ 166s ] thds: 32 tps: 62.53 qps: 366.65 (r/w/o: 0.00/246.10/120.55) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 166s ] queue length: 0, concurrency: 3
[ 168s ] thds: 32 tps: 56.97 qps: 340.84 (r/w/o: 0.00/227.39/113.45) lat (ms,95%): 383.33 err/s: 0.00 reconn/s: 0.00
[ 168s ] queue length: 0, concurrency: 2
[ 170s ] thds: 32 tps: 53.52 qps: 331.15 (r/w/o: 0.00/221.60/109.55) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 170s ] queue length: 0, concurrency: 7
[ 172s ] thds: 32 tps: 50.48 qps: 306.86 (r/w/o: 0.00/201.41/105.45) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 172s ] queue length: 0, concurrency: 16
[ 174s ] thds: 32 tps: 72.53 qps: 435.20 (r/w/o: 0.00/291.63/143.57) lat (ms,95%): 350.33 err/s: 0.00 reconn/s: 0.00
[ 174s ] queue length: 0, concurrency: 13
[ 176s ] thds: 32 tps: 69.97 qps: 408.84 (r/w/o: 0.00/273.39/135.45) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
[ 176s ] queue length: 0, concurrency: 4
[ 178s ] thds: 32 tps: 50.52 qps: 323.62 (r/w/o: 0.00/216.08/107.54) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 178s ] queue length: 0, concurrency: 17
[ 180s ] thds: 32 tps: 74.47 qps: 425.82 (r/w/o: 0.00/283.38/142.44) lat (ms,95%): 303.33 err/s: 0.50 reconn/s: 0.00
[ 180s ] queue length: 0, concurrency: 3
[ 182s ] thds: 32 tps: 53.02 qps: 330.66 (r/w/o: 0.00/220.60/110.05) lat (ms,95%): 493.24 err/s: 1.00 reconn/s: 0.00
[ 182s ] queue length: 0, concurrency: 9
[ 184s ] thds: 32 tps: 56.00 qps: 322.98 (r/w/o: 0.00/214.49/108.49) lat (ms,95%): 170.48 err/s: 0.50 reconn/s: 0.00
[ 184s ] queue length: 0, concurrency: 1
[ 186s ] thds: 32 tps: 49.50 qps: 299.52 (r/w/o: 0.00/200.01/99.51) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 186s ] queue length: 0, concurrency: 2
[ 188s ] thds: 32 tps: 59.47 qps: 356.83 (r/w/o: 0.00/237.89/118.94) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 188s ] queue length: 0, concurrency: 2
[ 190s ] thds: 32 tps: 53.02 qps: 321.65 (r/w/o: 0.00/214.60/107.05) lat (ms,95%): 110.66 err/s: 0.50 reconn/s: 0.00
[ 190s ] queue length: 0, concurrency: 3
[ 192s ] thds: 32 tps: 54.48 qps: 336.35 (r/w/o: 0.00/224.90/111.45) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 192s ] queue length: 0, concurrency: 8
[ 194s ] thds: 32 tps: 58.03 qps: 334.65 (r/w/o: 0.00/221.60/113.05) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 194s ] queue length: 0, concurrency: 2
[ 196s ] thds: 32 tps: 58.97 qps: 355.35 (r/w/o: 0.00/237.40/117.95) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 196s ] queue length: 0, concurrency: 2
[ 198s ] thds: 32 tps: 67.03 qps: 402.18 (r/w/o: 0.00/268.12/134.06) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 198s ] queue length: 0, concurrency: 2
[ 200s ] thds: 32 tps: 66.47 qps: 401.31 (r/w/o: 0.00/267.87/133.44) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 200s ] queue length: 0, concurrency: 3
SQL statistics:
    queries performed:
        read:                            0
        write:                           48622
        other:                           24346
        total:                           72968
    transactions:                        12111  (60.54 per sec.)
    queries:                             72968  (364.77 per sec.)
    ignored errors:                      124    (0.62 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          200.0381s
    total number of events:              12111

Latency (ms):
         min:                                   22.17
         avg:                                  142.63
         max:                                 3012.30
         95th percentile:                      634.66
         sum:                              1727352.75

Threads fairness:
    events (avg/stddev):           378.4688/5.05
    execution time (avg/stddev):   53.9798/1.81